#language: ru

@tree
@ExportScenarios

Функционал: заполнение шапки документа Заказ

Сценарий: заполнение шапки документа Заказ от ООО Все для дома
И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "Все для дома"'
И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Скороход АО'
И из выпадающего списка с именем "Склад" я выбираю точное значение 'Малый'
И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Закупочная'
И из выпадающего списка с именем "Валюта" я выбираю точное значение 'Рубли'
